{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Java's Database","n":0.707},"1":{"v":"# Welcome to Java's Info Database!\nHere is a collection of information Java uses for various things! if you were Linked here, chances are it was for a tutorial of some kind!\n\nIf you've come from the far reaches of the internet, welcome! You'll find a variety of little things from personal mumblings to tutorials made for friends. Maybe you too will find something useful!","n":0.126}}},{"i":2,"$":{"0":{"v":"Sal Scale","n":0.707},"1":{"v":"<font color=\"red\">Disclaimer</font>  \nThe information on this page is mostly for entertainment. You should absolutely use the scale because decimals are dumb. But its made in good fun\n\n---\n\n\nThe Sallery Scale (aka Sal Scale), is a general, 3-point, rating scale based on the idea that anything more than \"Good\", \"Ok\", \"Bad\" is completely superfluious. Created, coined and used by [Sallery](https://twitch.tv/sallery) the scale was developed in distaste for the use of decimals in 5-point and 10-point scales, that, despite having more numbers, one would still continue to use decimals rather than discreet numbers.\n\n## The Scale\nGiven it is a 3-point scale it is intuitive to understand.\n\n### 1 \"Bad\"\nThe lowest possible grade. On a 5-point scale, a 1 or 2 is considered a 1 on the Sal Scale. On a 10-point scale 1-3 is considered a 1.\n\nWhile this is the lowest possible grade, it isn't necessarily a complete negative hatred for any given subject. It could be something that one wouldn't play again, or something that one wouldn't recommend to others.\n\n### 2 \"Ok/Meh\"\nThe Middle/Mediocre grade. On a 5-point scale, a 3 is considered a 2. On a 10-point scale 4-7 is considered a 2.\n\nA middle of the road option, most subjects will land here. Nothing to write home about but not disliked.\n\n### 3 \"Good\"\nThe highest possible grade. On a 5-point scale, 4 or 5 is considered a 3. On a 10-point scale, 8-10 is considered a 3.\n\nWhile this is the highest possible grade, it does not mean that any given subject is \"Perfect\" or \"Life-changing\". Merely that the subject is notable enough that one would recommend to others or \n\n---\nThe scale has only 3 options, giving any one person the ability to consiscely grade and categorize any given subject. The scale should never have a decimal as it would completely defeat the purpose of the scale.\n\nAll the points on the scale are subject to the interpretation of the grader. Thus what may be considered a \"1\" for one person could be a \"2\" or someone else, much like other scales. However, unlike other scales something that would be between two grades (ie a 1.5) simply does not exist and immediately gets rounded down, with the understanding that on a Binary scale the grader would have given it a negative rating. The 2 on the scale exists for this purpose and should be used in that case.","n":0.051}}},{"i":3,"$":{"0":{"v":"Racc Pack","n":0.707},"1":{"v":"This Category is for everything related to \"The Racc Pack\" a R.E.P.O. modpack available via UUID Codes using r2modman.\n\n### Known Issues\nN/A\n\n### Known/Intentional Caveats\nN/A\n\n### Tutorials\n- [[meta.r2modman]]\n- [[raccpack.install]]\n- [[raccpack.update]]","n":0.192}}},{"i":4,"$":{"0":{"v":"Installing the Racc Pack","n":0.5},"1":{"v":"This guide will take you through the process of installing The Racc Pack.\n\nI'm assuming the following:\n1. You have r2modman installed. (if you do not have r2modman installed you can follow [[this guide|meta.r2modman]] to do so.)\n2. You are using a Windows device.\n3. You have R.E.P.O. installed in a path discoverable by Steam.\n\n## Selecting a game\nBy default r2modman will not have any game selected, or favorited. You can search for R.E.P.O. in the list.\n![](./assets/images/2025-05-03-19-20-26.png)\n1. Click the search box at the top an search for 'R.E.P.O.'\n2. Click R.E.P.O. to highlight it <font color=#3176bc>blue</font>\n3. Click Select game.\n\n**It is highly recommended you click the star next to the Game title to bring it to the top of your list**\n\n## Installing the Pack\nAfter Selecting the game, Click \"Import/Update\"\n![](./assets/images/2025-05-03-19-23-31.png)\n\nSelect \"From code\"\n![](./assets/images/2025-05-03-19-25-11.png)\n\nPaste the code in the following screen and press **Continue** then press **Import**\n![](./assets/images/2025-05-03-19-26-35.png)\n\nClick **Import new profile** if this is the first time installing. If you are updating, click **Update Existing Profile**.\n![](./assets/images/2025-05-03-19-30-20.png)\n\nGive it a name (Or select the previous name), and press Create (or update).\n![](./assets/images/2025-05-03-19-31-02.png)\n\nClick the profile to ensure its highlighted  <font color=#3176bc>Blue</font> and click **Select Profile**\n![](./assets/images/2025-05-03-19-33-19.png)\n\nLastly, click **Start Modded** and the game will launch.\n![](./assets/images/2025-05-03-19-34-18.png)","n":0.073}}},{"i":5,"$":{"0":{"v":"Magical Webcomic Alliance Hub","n":0.5},"1":{"v":"Section of Notes for the MWAH Server.","n":0.378}}},{"i":6,"$":{"0":{"v":"Custom Portals","n":0.707},"1":{"v":"This page is to be filled in, it will detail, how to setup a custom portal, how to customize the portal, and how to use the portal.\n\n## Creating a Portal\n\n## Customizing a Portal\n\n## Using a Portal","n":0.167}}},{"i":7,"$":{"0":{"v":"Claims","n":1},"1":{"v":"# In Progress","n":0.577}}},{"i":8,"$":{"0":{"v":"Meta","n":1},"1":{"v":"A category for general concepts not explicit to any particular pack.","n":0.302}}},{"i":9,"$":{"0":{"v":"Installing R2ModManager","n":0.707},"1":{"v":"This guide will show you how to install r2modman.\n\nThis guide assumes the following:\n1. You are using Windows 10/11.\n2. You already have Steam and the relevant game installed.\n\n## Installing R2ModMan\n\nHead to the [r2modman](https://r2modman.com/download/) website and click Download.\n![](./assets/images/2025-05-03-19-13-29.png)\n\nAfter downloading, Run the installer as you normally would. If you encounter an Unknown publisher error, click **More Info** and run anyway.\n\nOnce installation is finished you should see this screen:\n![](./assets/images/2025-05-03-19-15-26.png)\n\nClick finish and Launch r2modman! If you're here for the Racc Pack you can now head to [[raccpack.install]].","n":0.11}}},{"i":10,"$":{"0":{"v":"Installing Java 17","n":0.577},"1":{"v":"This guide will show you how to install Java 17 on a Windows Machine (if you're using Mac I cannot help. If you're using Linux, you already know what to do).\n\nThis guide assumes the following:\n1. You are using Windows 10.\n2. You are setting up Java for the Prism Launcher.\n3. You have already setup and installed Prism Launcher.\n\nWhile screenshots will be from Windows 10, I will also add information about Windows 11.\n\n## Checking the Installed Java Version\nFirst we want to see if you *actually have* Java installed.\n\nRight-Click the Start Menu button and select \"Windows Powershell\"\n![](assets/images/2024-03-01-00-37-20.png)\n\nNext, in the window that opens type in `java -version` and press <kbd>Enter</kbd>\n![](assets/images/2024-03-01-00-38-35.png)\n\nIt should spit out the following information\n```\nJava Version X.X.X_xxx\nJava(TM) SE Runtime Environment (build X.X.X_xxx-xxx)\nJava Hotspot(TM) XX-Bit Server VM (build XX.XXX-xxx, mixed mode)\n```\n\nThe correct version should be `17.0.10`. If in that text you see `1.8.0` next to `Runtime Enviroment` you have the incorrect version of Java and need to install the correct version.\n\n## Installing the Right Version of Java\nIf from the above section you have the incorrect version of Java we need to download the correct version.\n\nFirst download this [Ninite Installer](https://ninite.com/adoptjavax17/).\n\nThen press the big blue \"Download Installer\" button.\n![](./assets/images/2024-03-01-00-44-19.png)\n\nAfter it downloads, open the installer and let it do its thing.\n![](./assets/images/2024-03-01-00-45-53.png)\n\nIt will automatically install and setup Java 17 for you, when finished it will appear as so:\n![](./assets/images/2024-03-01-00-46-43.png)\n\nYou can click close and move on to setting up for Prism.\n\n## Setting up Prism\nWe've installed the correct version of Java, now we need to let Prism Launcher know where it is.\n\nFirst, Click on \"Settings\" in the Top Bar.\n![](./assets/images/2024-03-01-00-52-46.png)\n\nThen click on \"Java\" > \"Auto-Detect\"\n![](./assets/images/2024-03-01-00-54-35.png)\n\nFrom there, Select \"17.0.10\" and press \"OK\" (Usually it's the version with the \"⭐\" )\n![](./assets/images/2024-03-01-00-55-53.png)\n\nAfter that, Close the settings window and Launch your game!","n":0.059}}},{"i":11,"$":{"0":{"v":"LividJava's Create","n":0.707},"1":{"v":"This is the category for everything related to LividJava's Create the modpack created by Java.\n\n### Known Issues\n - Invisible Trader and Farm Blocks\n - Inability to Place Workstations inside Trader Blocks.\n\n### Known/Intentional Caveats\n - Inability to place boats in the Nether.\n\n### Tutorials\n - [[Diagnosing Lag|ljc.profiler]]\n - [[Updating the Pack|ljc.update]]","n":0.143}}},{"i":12,"$":{"0":{"v":"Update the Modpack","n":0.577},"1":{"v":"This guide will cover Updating the modpack on Prism and ATLauncher!\n\n## Prism Launcher\nUpdating is pretty simple! Just tucked away! To find it we just need to do a few things. Some things to note, my Prism layout and theme may differ slightly from yours.\n\n### Accessing the Pack Window & Updating\nFirst up Click on \"Edit\", either by selecting the Pack Icon and clicking \"Edit\", or by Right-Clicking and Selecting Edit\n![](./assets/images/2024-03-01-00-13-16.png)\n\nThen from there, click on the \"Modrinth\" Tab!\n![](./assets/images/2024-03-01-01-28-49.png)\n\nLastly, click \"Update Pack\" and you're up and running!\n![](./assets/images/2024-03-01-00-21-03.png)","n":0.109}}},{"i":13,"$":{"0":{"v":"Spark Profiler","n":0.707},"1":{"v":"If you're experiencing lag in this modpack, this is a guide on how to pinpoint the lag (or at the very least help me help you.)\n\nIf it isn't already. Close your game and install [Spark](https://spark.lucko.me). You can test to see if it's installed by running `/sparkc` in-game, if it returns command not found, you need to install it.\n\n## Finding Lag\nAfter installing Spark we need to determine a few things. Firstly, how long our lag spikes last, and then we can profile our game to actually find the source of the problem.\n\n### 1. Monitoring Ticks\nFirst up we need to start our Tick monitor. Achieve this by running `/sparkc tickmonitor`\n\n![](./assets/images/2023-04-21-23-29-28.png)\n\n![](./assets/images/2023-04-21-23-30-30.png)\nAfter the Initial analysis completes you may find some issues about GC, you can ignore this for now. Java's Garbage collector is... Garbage... We are looking for a HUGE spike in ticks.\n\n![](./assets/images/2023-04-21-23-33-13.png)\nThis is a pretty Sizeable spike! so much so it kicked me from the server! (hence the dimmed screenshot)\n\nNow we can run our profiler to try and find the actual source of the lag!\n\n### 2. Profiling the Game\nNow that we have some numbers we'll try and only capture the major spikes! First we need to take the lowest large spike, round it down to the nearest 50 and then start profiling it!\n\nIn the case above, our lowest significant spike was 106.76ms, so we'll round it down to 100\n\n![](./assets/images/2023-04-21-23-38-24.png)\n![](./assets/images/2023-04-21-23-38-51.png)\n\nNow our profiler is running, When any spike happens over 100ms it will be captured in our profiler! We want to try and recreate the lag as best we can (while avoiding a crash!).\n\nAfter we re-produce our spike, we can run `/sparkc profiler stop`\n![](./assets/images/2023-04-21-23-42-05.png)\n\nAnd our report will be generated!\n![](./assets/images/2023-04-21-23-42-25.png)\n\nWhile we're at it let's also disable the tickmonitor\n![](./assets/images/2023-04-21-23-43-14.png)\n\nNow we just click the link, and either open in browser to view it or copy to clipboard to throw at Java.\n![](./assets/images/2023-04-21-23-44-11.png)\n\nExamining the Profiler report is out of scope for this guide! You can instead follow the documentation from the [Spark page!](https://spark.lucko.me/docs/Using-the-viewer)\n\nThis guide was mostly derived from the Spark documentation anyway. Just in a more verbose manner.","n":0.054}}},{"i":14,"$":{"0":{"v":"Installing the Modpack","n":0.577},"1":{"v":"This will guide you onto installing the modpack and joining the server!\n\nI'm assuming the following things.\n1. You are using the [Prism Launcher](https://prismlauncher.org/)\n2. You have a version of Java 17 installed. (In case you don't you can check [[meta.java17]] to see how to install.)\n\n## Creating the Instance\n\nFirst you're going to click on \"Add Instance\"\n![](./assets/images/2024-03-01-00-02-02.png)\n\nFrom there you're going to select \"Modrinth\" from the Left-hand sidebar.\n![](./assets/images/2024-03-01-00-03-16.png)\n\nIn the Search Bar, type in \"LividJava's Create\" and click \"Search\".\n![](./assets/images/2024-03-01-00-05-03.png)\n\nClick on The Pack \"LividJava's Create Re-Stitched\" and press \"OK\"\n![](./assets/images/2024-03-01-00-08-40.png) \n\n## Troubleshooting\nSometimes things don't run right.\n\n### Allocating more RAM\nIf your pc is struggling to run the modpack, you might not be allocating enough RAM. The recommend amount is At least 6GB (6144 MiB). This section will cover how to allocate more RAM to the game.\n\nRight-click the Modpack Icon and click on \"Edit...\".\n![](./assets/images/2024-03-01-00-13-16.png)\n\nClick the \"Settings\" button on the Left-hand side, and tick the box next to \"Memory\".\n![](./assets/images/2024-03-01-00-14-56.png)\n\nDouble-Click in the Highlighed box and replace the value with \"6144\" (Or higher if your system can support that).\n![](./assets/images/2024-03-01-00-16-38.png)\n\nAfter that. You're done!! If you have further issues, I recommend checking out the [[ljc.profiler]] article.\n\nAlso recommeneded to read up on [[Updating the Modpack|ljc.update]] so you know how!","n":0.072}}},{"i":15,"$":{"0":{"v":"Linux Streaming/Tools","n":0.707},"1":{"v":"This section is dedicated to Linux Streaming. Listing out useful programs, workflow ideas, and other various tools based around my own experience. If you're looking for general streaming tools/Windows Tools you can see the [[windows]] section for that, it will be sparce and outdated as I have ceased usage of Windows since January 7th, 2024. If you're curious you can see why in [[personal.anecdotes.whylinux]]. I try to provide open-source alternatives where possible.\n\n## Streaming Tools\n - [[linux.deckboard]]\n - [[linux.firebot]]\n - [[linux.wayland]]\n","n":0.112}}},{"i":16,"$":{"0":{"v":"Wayland","n":1}}},{"i":17,"$":{"0":{"v":"Firebot","n":1},"1":{"v":"|Is free?|Type|\n|-|-|\n|#free|#software|\n---\nFirebot is a \"Stream Manager\" as I like to call it or more commonly, stream/chat bot. It's similar to something like streamer.bot or Mix It Up.","n":0.192}}},{"i":18,"$":{"0":{"v":"Deckboard","n":1},"1":{"v":"|Is free?|Type|\n|-|-|\n|#nonfree|#software|\n---\nDeckboard is an Alternative to the very expensive Elgato Streamdeck. There are two components to it, the Server application, and the Client application. The client application is to be installed on your Smartphone (it is compatible with both iOS and Android systems, as well as compatible with Windows machines). The Server application is to be installed on the machine you'd like to control, It has a variety of plugins available from its community.","n":0.116}}}]}
